---
kind: method
id: M:Autodesk.Revit.DB.Structure.PathReinforcement.IsAlternatingLayerEnabled
source: html/2f3af8f8-18c1-8b9f-2ed4-2d049260af86.htm
---
# Autodesk.Revit.DB.Structure.PathReinforcement.IsAlternatingLayerEnabled Method

Checks if alternating bars are present in Path Reinforcement.

## Syntax (C#)
```csharp
public bool IsAlternatingLayerEnabled()
```

## Returns
True if the alternating bars exist in Path Reinforcement instance.